cf_billing/Catalogs/энргДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.энргАбоненты</xr:Item>
				<xr:Item>Catalog.энргДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>800</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестГруппыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерДоговораОРЭМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораОРЭМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодДоговораERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПролонгацияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаключенияДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыЗаключенияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУслугиПоПередаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПролонгации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронноеВзаимодействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПотребителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДопСоглашения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиУведомленийПИР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаРасчеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставщикКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргОтрасли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Министерство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМинистерства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестКонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыБизнесПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектБП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьНомерПломбыПрибораУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктированиеНедопускаДопускаЮЛ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьНагрузкуПоУслугам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьПараметрыТочкиУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктПринятияПрибораУчетаККоммерческомуУчету</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеТемпературногоГрафикаОбъектов</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГарантированныеОбъемыНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьЗначениеПлощадиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературыИсточника</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзмененитьРазрядностьОбъемовУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДоговорПоУслуге</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГруппуПотребителейНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературуНаружногоВоздуха</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТочкиПоставкиНаОбъектРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСпособНачисленияПоНормативуНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПотребителейГВС</v8:Type>
								<v8:Type>cfg:DocumentRef.бестСменаПоставщикаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДанныеДляДополнительногоРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСреднемесячнуюТемпературу</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьДатуПоверкиПУ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПоказателиТемпературыВнутриПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.бестРегистрацияБездоговорногоБезучетногоПотребления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/бестПользовательскийВводКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийШапкиФормы

// Процедура - Начало выбора договора.
// Открытие формы выбора Договоров контрагента с отборами.
//
// Параметры:
//  Элемент					-	ПолеФормы.
//  Организация				-	СправочникСсылка.Организации.
//  Контрагент				-	СправочникСсылка.энргКонтрагенты.
//  СтандартнаяОбработка	-	Булево.
//  БлокЮридическихЛиц		-	Булево.
//
Процедура НачалоВыбораДоговора(Элемент, Организация, Контрагент = Неопределено, СтандартнаяОбработка, БлокЮридическихЛиц = Истина) Экспорт 
	СтандартнаяОбработка 	= ложь;	
	Отбор					= Новый Структура();
	ПараметрыВыбора  		= Новый Структура;
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент) тогда
		Отбор.Вставить("Контрагент",Контрагент);
	КонецЕсли;
	Отбор.Вставить("БлокЮридическихЛиц", БлокЮридическихЛиц);
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаВыбора",ПараметрыВыбора,Элемент);
КонецПроцедуры

// Процедура - Начало выбора объекта.
// Открытие формы выбора Объектов расчета с отборами.
//
// Параметры:
//  Элемент					-	ПолеФормы.
//  Период					-	Дата.
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  Договор					-	СправочникСсылка.энргДоговорыКонтрагентов.
//  СтандартнаяОбработка	-	Булево.
//  Включенные				-	Булево.
//
Процедура НачалоВыбораОбъекта(Элемент,Период,Организация,Район,Договор,СтандартнаяОбработка, Включенные) Экспорт  
	СтандартнаяОбработка 	= Ложь;
	ПараметрыВыбора  		= Новый Структура("Договор,Организация,Район,Период,Включенные",Договор, Организация, Район, Период, Включенные);
	ОткрытьФорму("Справочник.бестОбъектыРасчета.Форма.ФормаВыбора",ПараметрыВыбора,Элемент,,,,);	
КонецПроцедуры

// Процедура - При изменении договора контрагента.
// Заполнение свойств объекта реквизитами Договора.
//
// Параметры:
//  Объект				-	ДанныеФормыСтруктура.
//  ИсключаемыеСвойства	-	Строка.
//
Процедура ПриИзмененииДоговораКонтрагента(Объект, ИсключаемыеСвойства = "") Экспорт 
	
	ДанныеДоговора  		= энргРаботаСЛицевымСчетомКлиент.СтруктураЗначенийЗаполненияДоговора();
	ДанныеДоговора.Удалить("ДатаФактическогоСобытия");
	бестПользовательскийВводСервер.УстановитьЗависимыеРеквизитыДоговораКонтрагента(Объект.Договор,ДанныеДоговора);
	ЗаполнитьЗначенияСвойств(Объект,ДанныеДоговора);
		
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

// Функция отображает настраиваемый диалог выбора файлов или каталогов с заданными параметрами и возвращает
// путь к выбранному объекту либо пустую строку при отмене.
//
// Параметры:
//  Режим				-	РежимДиалогаВыбораФайла.
//  Заголовок			-	Строка					-	заголовок окна диалога.
//  Фильтр				-	Строка					-	фильтр файлов по расширениям.
//  МножественныйВыбор	-	Булево					-	разрешить выбор нескольких файлов.
//
// Возвращаемое значение:
//  Строка	-	выбранный путь.
//
Функция РаботаСДиалогомВыбора(Режим,Заголовок,Фильтр = Неопределено,МножественныйВыбор = Ложь) Экспорт 
	Диалог 						= Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок 			= Заголовок;
	Диалог.МножественныйВыбор 	= МножественныйВыбор;
	
	Если не Фильтр = Неопределено Тогда
		Диалог.Фильтр = Фильтр;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		Путь = ?(Режим = РежимДиалогаВыбораФайла.Открытие,Диалог.ПолноеИмяФайла,Диалог.Каталог);
	Иначе
		Предупреждение(НСтр("ru = 'Путь не выбран!'"));
		Путь = "";
	КонецЕсли;
	
	Возврат Путь;
КонецФункции

// Возвращает ключ заполнения информации объекта.
// 
// Возвращаемое значение:
//  Строка	-	ключ заполнение информации объекта.
//
Функция ПолучитьКлючЗаполненияИнформацииОбъекта() Экспорт
	 Возврат "НаименованиеОбъектаРасчета,НазначениеНП,КоличествоРабочихДней,КоличествоРабочихЧасовВДень,ПотреблениеВРабДни,ПотреблениеВРВыхДни,НаличиеГенерирующихУстановок,НагрузкаЭлектроприемника,РежимЭлСнабжения";
КонецФункции

#КонецОбласти

#КонецОбласти
